app/views/books/_index.html.erb

              <%= link_to book_favorites_path(book), method: :delete do %>
                <i class="fa fa-heart liked" ><%= book.favorites.count %></i>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

              <%= link_to book_favorites_path(book), method: :post do %>
                <i class="fa fa-heart" ><%= book.favorites.count %></i>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 4]]

        </td>
        <td>コメント数：<%= book.book_comments.count %></td>
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]