app/views/books/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
                <%= link_to book_favorites_path(@book), method: :delete do %>
                  <i class="fa fa-heart liked" ><%= @book.favorites.count %></i>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
                <%= link_to book_favorites_path(@book), method: :post do %>
                  <i class="fa fa-heart" ><%= @book.favorites.count %></i>

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
          </td>
          <td>コメント数：<%= @book.book_comments.count %></td>

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
      <table class="table">
        <% @book.book_comments.each do |book_comment| %>