app/controllers/book_comments_controller.rb

  def create
    book = Book.find(params[:book_id])
    comment = BookComment.new(book_comment_params)
    comment.user_id = current_user.id
    # comment = current_user.book_comments.new(book_comment_params)
    comment.book_id = book.id
    comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "test"], ["user_id", 1], ["book_id", 1], ["created_at", "2021-06-02 08:43:01.071721"], ["updated_at", "2021-06-02 08:43:01.071721"]]

  def destroy
    comment = BookComment.find(params[:book_id])
    if comment.user == current_user
      comment.delete
---
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 1]]