app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @new_book = Book.new
    @book = Book.find(params[:id])

SELECT "books".* FROM "books"
---
  def index
    @user = current_user
    @books = Book.all